<!--
 * @Description: file description
 * @Author: LiuHuaifu
 * @Date: 2019-12-08 20:47:30
 * @LastEditors: your name
 * @LastEditTime: 2019-12-09 13:32:20
 -->
<template>
  <div class="formal-article">
    <div class="main">
      <body-block #module>
        <article-main :pathList="pathList" :article="article" />
      </body-block>
    </div>
  </div>
</template>
<script>
import BodyBlock from "../components/BodyBlock";
import ArticleMain from "../components/common/ArticleMain";

export default {
  data() {
    return {
      pathList: [
        { to: "/studyNote", name: "学习笔记" },
        { to: "/sourceCode", name: "源码分析" },
        { to: "/liveRecord", name: "生活随记" }
      ],
      article: {
        author: "Danker",
        date: "2019-12-8",
        views: "10",
        tags: ["javascript", "css3"],
        profit: "这是简介",
        title: "正文啦啦啦啦",
        content: `阿萨德理发卡代理商阿里SDK发牢骚开饭啦使得开发拉克丝代理费卡萨丁洛克菲勒斯洛伐克理发店可忽略幅地块；理工大弗兰克美国 阿斯兰地方快递费贾师傅点开了  <p>阿善动飞机阿迪搜姜思达佛j艾弗森地会计分录看待世界垦利街道萨克冷风机考虑克里斯大反馈了恐龙当家考虑考虑333333333阿萨德开了房奇偶安德森咖啡机就搜到法斯柯达就发啦金坷垃的设计费立刻就爱上代理费就离开的撒娇弗兰克氨基酸砥砺奋进阿四大防控甲ADSL扣均分禄口街道雷克赛结算单房间里的哭声积分 </p>有一个人，一生中经历了1009次失败。但他却说：“一次成功就够了。
        一次成功就够了　　5岁时，他的父亲突然病逝，没有留下任何财产。母亲外出做工。年幼的他在家照顾弟妹，并学会自己做饭。
　　  12岁时，母亲改嫁，继父对他十分严厉，常在母亲外出时痛打他。
　　  14岁时，他辍学离校，开始了流浪生活。
　　  16岁时，他谎报年龄参加了远征军。因航行途中晕船厉害，被提前遣送回乡。
　　  18岁时，他娶了个媳妇。但只过了几个月，媳妇就变卖了他所有的财产逃回娘家。
　　  20岁时，他当电工、开轮渡，后来又当铁路工人，没有一样工作顺利。
　　  30岁时，他在保险公司从事推销工作，后因奖金问题与老板闹翻而辞职。
　　  31岁时，他自学法律，并在朋友的鼓动下干起了律师行当。一次审案时，竟在法庭上与当事人大打出手
　　  32岁时，他失业了，生活非常艰难。
　　  35岁时，不幸又一次降临到他的头上。当他开车路过一座大桥时，大桥钢绳断裂。他连人带车跌到河中，身受重伤，无法再干轮胎推销员工作。
　　  40岁时，他在一个镇上开了一家加油站，因挂　  16岁时，他谎报年龄参加了远征军。因航行途中晕船厉害，被提前遣送回乡。
　　  18岁时，他娶了个媳妇。但只过了几个月，媳妇就变卖了他所有的财产逃回娘家。
　　  20岁时，他当电工、开轮渡，后来又当铁路工人，没有一样工作顺利。
　　  30岁时，他在保险公司从事推销工作，后因奖金问题与老板闹翻而辞职。
　　  31岁时，他自学法律，并在朋友的鼓动下干起了律师行当。一次审案时，竟在法庭上与当事人大打出手
　　  32岁时，他失业了，生活非常艰难。
　　  35岁时，不幸又一次降临到他的头上。当他开车路过一座大桥时，大桥钢绳断裂。他连人带车跌到河中，身受重伤，无法再干轮胎推销员工作。
　　  40岁时，他在一个镇上开了一家加油站，因挂广告牌把竞争对手打伤，引来一场纠纷。
　　  47岁时，他与第二任妻子离婚，三个孩子深受打击。
　　  61岁时，他竞选参议员，但最后落败。
　　  65岁时，政府修路拆了他刚刚红火的快餐馆，他不得不低价出售了所有设备。
　　  66岁时，为了维持生活，他到各地的小餐馆推销自己掌握的炸鸡技术。　  16岁时，他谎报年龄参加了远征军。因航行途中晕船厉害，被提前遣送回乡。
　　  18岁时，他娶了个媳妇。但只过了几个月，媳妇就变卖了他所有的财产逃回娘家。
　　  20岁时，他当电工、开轮渡，后来又当铁路工人，没有一样工作顺利。
　　  30岁时，他在保险公司从事推销工作，后因奖金问题与老板闹翻而辞职。
　　  31岁时，他自学法律，并在朋友的鼓动下干起了律师行当。一次审案时，竟在法庭上与当事人大打出手
　　  32岁时，他失业了，生活非常艰难。
　　  35岁时，不幸又一次降临到他的头上。当他开车路过一座大桥时，大桥钢绳断裂。他连人带车跌到河中，身受重伤，无法再干轮胎推销员工作。
　　  40岁时，他在一个镇上开了一家加油站，因挂广告牌把竞争对手打伤，引来一场纠纷。
　　  47岁时，他与第二任妻子离婚，三个孩子深受打击。
　　  61岁时，他竞选参议员，但最后落败。
　　  65岁时，政府修路拆了他刚刚红火的快餐馆，他不得不低价出售了所有设备。
　　  66岁时，为了维持生活，他到各地的小餐馆推销自己掌握的炸鸡技术。　  16岁时，他谎报年龄参加了远征军。因航行途中晕船厉害，被提前遣送回乡。
　　  18岁时，他娶了个媳妇。但只过了几个月，媳妇就变卖了他所有的财产逃回娘家。
　　  20岁时，他当电工、开轮渡，后来又当铁路工人，没有一样工作顺利。
　　  30岁时，他在保险公司从事推销工作，后因奖金问题与老板闹翻而辞职。
　　  31岁时，他自学法律，并在朋友的鼓动下干起了律师行当。一次审案时，竟在法庭上与当事人大打出手
　　  32岁时，他失业了，生活非常艰难。
　　  35岁时，不幸又一次降临到他的头上。当他开车路过一座大桥时，大桥钢绳断裂。他连人带车跌到河中，身受重伤，无法再干轮胎推销员工作。
　　  40岁时，他在一个镇上开了一家加油站，因挂广告牌把竞争对手打伤，引来一场纠纷。
　　  47岁时，他与第二任妻子离婚，三个孩子深受打击。
　　  61岁时，他竞选参议员，但最后落败。
　　  65岁时，政府修路拆了他刚刚红火的快餐馆，他不得不低价出售了所有设备。
　　  66岁时，为了维持生活，他到各地的小餐馆推销自己掌握的炸鸡技术。　  16岁时，他谎报年龄参加了远征军。因航行途中晕船厉害，被提前遣送回乡。
　　  18岁时，他娶了个媳妇。但只过了几个月，媳妇就变卖了他所有的财产逃回娘家。
　　  20岁时，他当电工、开轮渡，后来又当铁路工人，没有一样工作顺利。
　　  30岁时，他在保险公司从事推销工作，后因奖金问题与老板闹翻而辞职。
　　  31岁时，他自学法律，并在朋友的鼓动下干起了律师行当。一次审案时，竟在法庭上与当事人大打出手
　　  32岁时，他失业了，生活非常艰难。
　　  35岁时，不幸又一次降临到他的头上。当他开车路过一座大桥时，大桥钢绳断裂。他连人带车跌到河中，身受重伤，无法再干轮胎推销员工作。
　　  40岁时，他在一个镇上开了一家加油站，因挂广告牌把竞争对手打伤，引来一场纠纷。
　　  47岁时，他与第二任妻子离婚，三个孩子深受打击。
　　  61岁时，他竞选参议员，但最后落败。
　　  65岁时，政府修路拆了他刚刚红火的快餐馆，他不得不低价出售了所有设备。
　　  66岁时，为了维持生活，他到各地的小餐馆推销自己掌握的炸鸡技术。　  16岁时，他谎报年龄参加了远征军。因航行途中晕船厉害，被提前遣送回乡。
　　  18岁时，他娶了个媳妇。但只过了几个月，媳妇就变卖了他所有的财产逃回娘家。
　　  20岁时，他当电工、开轮渡，后来又当铁路工人，没有一样工作顺利。
　　  30岁时，他在保险公司从事推销工作，后因奖金问题与老板闹翻而辞职。
　　  31岁时，他自学法律，并在朋友的鼓动下干起了律师行当。一次审案时，竟在法庭上与当事人大打出手
　　  32岁时，他失业了，生活非常艰难。
　　  35岁时，不幸又一次降临到他的头上。当他开车路过一座大桥时，大桥钢绳断裂。他连人带车跌到河中，身受重伤，无法再干轮胎推销员工作。
　　  40岁时，他在一个镇上开了一家加油站，因挂广告牌把竞争对手打伤，引来一场纠纷。
　　  47岁时，他与第二任妻子离婚，三个孩子深受打击。
　　  61岁时，他竞选参议员，但最后落败。
　　  65岁时，政府修路拆了他刚刚红火的快餐馆，他不得不低价出售了所有设备。
　　  66岁时，为了维持生活，他到各地的小餐馆推销自己掌握的炸鸡技术。广告牌把竞争对手打伤，引来一场纠纷。
　　  47岁时，他与第二任妻子离婚，三个孩子深受打击。
　　  61岁时，他竞选参议员，但最后落败。
　　  65岁时，政府修路拆了他刚刚红火的快餐馆，他不得不低价出售了所有设备。
　　  66岁时，为了维持生活，他到各地的小餐馆推销自己掌握的炸鸡技术。
　　  75岁时，他感到力不从心，因此转让了自己创立的品牌和专利。新主人提议给他1万股，作为购买价的一部分，他拒绝了。后来公司股票大涨，他因此失去了成为亿万富翁的机会。
　　83岁时，他又开了一家快餐店，却因商标专利与人打起了官司。
　　88岁时，他终于大获成功，全世界都知道了他的名字。
　　他，就是肯德基的创始人——哈伦德·山德士。他说：“人们经常抱怨天气不好，实际上并不是天气不好。只要自己有乐观自信的心情，天天都是好天气。`
      }
    };
  },
  components: {
    BodyBlock,
    ArticleMain
  }
};
</script>
<style lang="scss" scoped>
.formal-article {
  width: 100%;
}
</style>